Repository: JD0001/hiberus-frontend-test
Catalog: src/assets/locale/messages.*.xlf
Languages: es_es

source: Return to home
es_es: Volver a inicio

source: Filter the heroes as you wish
es_es: Filtra los héroes como gustes

source: Use a single filter or either combine some of them to make a more restrictive filtering
es_es: Usa un único filtro o combina varios de ellos para hacer un filtrado más preciso

source: Filter hero by alias
es_es: Filtrar héroe por alias

source: For example: 'Spider'
es_es: Por ejemplo: 'Spider'

source: Filter hero by name
es_es: Filtrar héroe por nombre

source: For example: 'Steve'
es_es: Por ejemplo: 'Juan'

source: Filter hero by country ISO
es_es: Filtrar hèroe por código de país ISO

source: For example: 'USA'
es_es: Por ejemplo: 'ES'

source: Apply filter
es_es: Aplicar filtro

source: Refresh list from database
es_es: Actualizar lista desde base de datos

source: Actions
es_es: Acciones

source: Shown data in the table can be edited with the corresponding controls
es_es: La información mostrada puede ser editada con los controles correspondientes

source: Create Hero
es_es: Crear héroe

source: For editing or deleting a hero, please use the embedded buttons availables for each one.
es_es: Para editar o eliminar un héroe, por favor usa los controles embedidos disponibles para cada uno

source: Name
es_es: Nombre

source: Country
es_es: País

source: There aren't any results
es_es: No se encontraron resultados

source: Welcome to the heroes application
es_es: Bienvenido a la aplicación de héroes

source: This application is a simple example of some of the features that Angular provides for developing, in this case, single page applications
es_es: Esta aplicación es un simple ejemplo de algunas de las características que Angular proporciona para desarrollar, en este caso, aplicaciones de página única (SPA)

source: What's this about?
es_es: ¿De qué va esto?

source: A short explanation about the case
es_es: Una corta explicación sobre el caso

source: The main feature of the application revolves around a heroes list, similar to the Angular introductory tutorial used for introduce itself. This app includes a really simple REST backend with some mocked data and some interaction with that information. It implements the following concepts
es_es: La característica principal de la aplicación gira entorno una lista de héroes, similar al tutorial introductorio de Angular utilizar para introducirse a sí mismo, que incluye un simple backend REST con algo de información simulada y algunas interacciones con dicha información, por ejemplo, los siguientes conceptos

source: Check out the heroes list
es_es: Echa un vistazo a la lista de héroes

source: Components
es_es: Componentes

source: Services
es_es: Servicios

source: Lazy loading
es_es: Carga débil (Lazy loading)

source: HTTPClient module
es_es: Módulo HTTPClient

source: Angular material library
es_es: Librería material de Angular

source: Please, wait while we talk with the backend
es_es: Por favor, espera mientras nos comunicamos con el backend

source: There wasn't any response from the backend
es_es: No hubo ninguna respuesta desde el servidor

source: Are you sure you want to delete the specified hero?
es_es: ¿Estás seguro de que quieres eliminar el héroe especificado?

source: Cancel
es_es: Cancelar

source: Confirm
es_es: Confirmar

source: Create a new Hero
es_es: Crear un héroe nuevo

source: Please have in count that the information must be compliant with the validations
es_es: Por favor, ten en cuenta que la información debe cumplir las validaciones

source: Minimum of {{_ALIAS_MIN_LENGHT}} and maximum of {{_ALIAS_MAX_LENGHT}} characters
es_es: Mínimo de {{_ALIAS_MIN_LENGHT}} y máximo de {{_ALIAS_MAX_LENGHT}} carácteres

source: LENGTH ( {{alias.value.length}} / {{ _ALIAS_MIN_LENGHT +' - '+ _ALIAS_MAX_LENGHT}} )
es_es: TAMAÑO ( {{alias.value.length}} / {{ _ALIAS_MIN_LENGHT +' - '+ _ALIAS_MAX_LENGHT}} )

source: USE ONLY ALPHABETIC CHARACTERS!
es_es: ¡USA SÓLO CARÁCTERES ALFABETICOS!

source: Two alphabetic char ISO code
es_es: Código ISO de dos carácteres alfabéticos

source: UPPERCASE 2 CHAR ISO CODE (A-Z)
es_es: CÓDIGO ISO DE 2 CARACTERES EN MAYÚSCULAS (A-Z)

source: Save
es_es: Guardar
